//-----------------------------------------------------------------
// 程序描述:
//     基于程序延时的不同延时时基的程序：us,ms
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 当前版本: V1.0
// 历史版本:
//   - V1.0: 基于STM32的延时：us,ms
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2
// 说    明:
//
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "bsp_spi.h"
//#include "spi.h"
//-----------------------------------------------------------------
//
// 函数功能: SPI驱动程序，配置成主机模式
// 入口参数: 无
// 返 回 值: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void W25Q_SPI_Enable(void)
{
//    __HAL_SPI_ENABLE(&hspi1); // 使能SPI1
}
//-----------------------------------------------------------------
// void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler)
//-----------------------------------------------------------------
//
// 函数功能: SPI速度设置函数
// 入口参数: u8 SPI_BaudRatePrescaler：SPI_BAUDRATEPRESCALER_2~SPI_BAUDRATEPRESCALER_2 256
// 返 回 值: 无
// 注意事项: SPI速度=fAPB1/分频系数，fAPB1时钟一般为45Mhz
//
//-----------------------------------------------------------------
void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler)
{
//    assert_param(IS_SPI_BAUDRATE_PRESCALER(SPI_BaudRatePrescaler)); // 判断有效性
//    __HAL_SPI_DISABLE(&hspi1);                                      // 关闭SPI
//    hspi1.Instance->CR1 &= ~(0X7 << 28);                            // 位3-5清零，用来设置波特率
//    hspi1.Instance->CR1 |= SPI_BaudRatePrescaler;                   // 设置SPI速度
//    __HAL_SPI_ENABLE(&hspi1);                                       // 使能SPI
}

//-----------------------------------------------------------------
// u8 SPI1_ReadWriteByte(u8 TxData)
//-----------------------------------------------------------------
//
// 函数功能: SPI1读写一个字节
// 入口参数: u8 TxData： 要写入的字节
// 返 回 值: u8 Rxdata：读取到的字节
// 注意事项: 无
//
//-----------------------------------------------------------------
u8 SPI1_ReadWriteByte(u8 TxData)
{
//    u8 Rxdata;
//    HAL_SPI_TransmitReceive(&hspi1, &TxData, &Rxdata, 1, 1000);
//    return Rxdata; // 返回收到的数据
	return 0;
}
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
