//-----------------------------------------------------------------
// 程序描述:
//     字库更新驱动程序头文件
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2020-11-11)	字库更新
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2、4.3寸/2.8寸
// 说    明: 
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#ifndef __HZUP_H__
#define __HZUP_H__	 
#include "bsp_system.h"
#include "ff.h"	
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 声明
//-----------------------------------------------------------------
// 字体信息保存地址,占41个字节,第1个字节用于标记字库是否存在.后续每8个字节一组,分别保存起始地址和文件大小														   
extern u32 FONTINFOADDR;	
// 字库信息结构体定义
// 用来保存字库基本信息，地址，大小等
typedef struct __attribute__((packed))
{
	u8 fontok;				// 字库存在标志，0XAA，字库正常；其他，字库不存在
	u32 ugbkaddr; 		// unigbk的地址
	u32 ugbksize;			// unigbk的大小	 
	u32 f12addr;			// gbk12地址	
	u32 gbk12size;		// gbk12的大小	 
	u32 f16addr;			// gbk16地址
	u32 gbk16size;		// gbk16的大小		 
	u32 f24addr;			// gbk24地址
	u32 gbk24size;		// gbk24的大小 	 
	u32 f32addr;			// gbk32地址
	u32 gbk32size;		// gbk32的大小 
}_font_info; 

extern _font_info ftinfo;	// 字库信息结构体
extern FATFS fatfs;       // 逻辑驱动器的工作区
//-----------------------------------------------------------------
// 函数声明
//-----------------------------------------------------------------
u32 fupd_prog(u16 x,u16 y,u8 size,u32 fsize,u32 pos);		// 显示更新进度
u8 update_font(u16 x,u16 y,u8 size);										// 更新全部字库
u8 font_init(void);																			// 初始化字库

#endif
//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
